<?xml version="1.0"?>
<net name="Model0" version="11">
	<layers>
		<layer id="0" name="x" type="Parameter" version="opset1">
			<data shape="?,80,?" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="x">
					<dim>-1</dim>
					<dim>80</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="__module.conv1/aten::to/Convert_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="384, 80, 3" offset="0" size="184320" />
			<output>
				<port id="0" precision="FP16" names="45,weight.3">
					<dim>384</dim>
					<dim>80</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="__module.conv1/aten::to/Convert" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>384</dim>
					<dim>80</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>384</dim>
					<dim>80</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="__module.conv1/aten::_convolution/Convolution" type="Convolution" version="opset1">
			<data strides="1" dilations="1" pads_begin="1" pads_end="1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>80</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>384</dim>
					<dim>80</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>384</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="__module.conv1/aten::_convolution/Reshape_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 384, 1" offset="184320" size="768" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>384</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="__module.conv1/aten::_convolution/Reshape" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>384</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>384</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="__module.conv1/aten::_convolution/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>384</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>384</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="51">
					<dim>-1</dim>
					<dim>384</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="aten::gelu/Gelu" type="Gelu" version="opset7">
			<data approximation_mode="ERF" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>384</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="16,input.1">
					<dim>-1</dim>
					<dim>384</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="__module.conv2/aten::to/Convert_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="384, 384, 3" offset="185088" size="884736" />
			<output>
				<port id="0" precision="FP16" names="61,weight.7">
					<dim>384</dim>
					<dim>384</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="__module.conv2/aten::to/Convert" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>384</dim>
					<dim>384</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>384</dim>
					<dim>384</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="__module.conv2/aten::_convolution/Convolution" type="Convolution" version="opset1">
			<data strides="2" dilations="1" pads_begin="1" pads_end="1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>384</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>384</dim>
					<dim>384</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>384</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="__module.conv2/aten::_convolution/Reshape_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 384, 1" offset="1069824" size="768" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>384</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="__module.conv2/aten::_convolution/Reshape" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>384</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>384</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="__module.conv2/aten::_convolution/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>384</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>384</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="67">
					<dim>-1</dim>
					<dim>384</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="aten::gelu/Gelu_1" type="Gelu" version="opset7">
			<data approximation_mode="ERF" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>384</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="19,x.3">
					<dim>-1</dim>
					<dim>384</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="Constant_123" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="1070592" size="24" />
			<output>
				<port id="0" precision="I64" names="23">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="aten::permute/Transpose" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>384</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="24,x.5">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="Constant_4427_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1500, 384" offset="1070616" size="1152000" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1500</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="Constant_4427" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1500</dim>
					<dim>384</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1500</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="aten::add/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>384</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1500</dim>
					<dim>384</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="26,31,87,93,input.3,x.7">
					<dim>-1</dim>
					<dim>1500</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="__module.blocks.0.attn_ln/aten::layer_norm/Multiply" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="2222616" size="4" />
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="__module.blocks.0.attn_ln/aten::layer_norm/MVN" type="MVN" version="opset6">
			<data eps="9.9999997473787516e-06" normalize_variance="true" eps_mode="INSIDE_SQRT" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>1500</dim>
					<dim>384</dim>
				</port>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>1500</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="Constant_4428_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 384" offset="2222620" size="768" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="Constant_4428" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>384</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="__module.blocks.0.attn_ln/aten::layer_norm/Multiply_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>1500</dim>
					<dim>384</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>384</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>1500</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="Constant_4429_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 384" offset="2223388" size="768" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="Constant_4429" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>384</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="__module.blocks.0.attn_ln/aten::layer_norm/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>1500</dim>
					<dim>384</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>384</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="89,90,92,x.9">
					<dim>-1</dim>
					<dim>1500</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="__module.blocks.0.attn.query/aten::to/Convert_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="384, 384" offset="2224156" size="294912" />
			<output>
				<port id="0" precision="FP16" names="100">
					<dim>384</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="__module.blocks.0.attn.query/aten::to/Convert" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>384</dim>
					<dim>384</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>384</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="__module.blocks.0.attn.query/aten::linear/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>1500</dim>
					<dim>384</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>384</dim>
					<dim>384</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>1500</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="Constant_4430_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 384" offset="2519068" size="768" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="Constant_4430" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>384</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="__module.blocks.0.attn.query/aten::linear/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>1500</dim>
					<dim>384</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>384</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="102,q.1">
					<dim>-1</dim>
					<dim>1500</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="__module.blocks.0.attn/prim::ListConstruct" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="2519836" size="32" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="__module.blocks.0.attn/aten::view/Reshape" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>1500</dim>
					<dim>384</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="114">
					<dim>-1</dim>
					<dim>1500</dim>
					<dim>6</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="Constant_228" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="2519868" size="32" />
			<output>
				<port id="0" precision="I64" names="115">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="__module.blocks.0.attn/aten::permute/Transpose" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>1500</dim>
					<dim>6</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="116,q.3">
					<dim>-1</dim>
					<dim>6</dim>
					<dim>1500</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="__module.blocks.0.attn.key/aten::to/Convert_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="384, 384" offset="2519900" size="294912" />
			<output>
				<port id="0" precision="FP16" names="104">
					<dim>384</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="__module.blocks.0.attn.key/aten::to/Convert" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>384</dim>
					<dim>384</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>384</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="__module.blocks.0.attn.key/aten::linear/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>1500</dim>
					<dim>384</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>384</dim>
					<dim>384</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="105,k.1">
					<dim>-1</dim>
					<dim>1500</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="__module.blocks.0.attn/prim::ListConstruct_1" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="2519836" size="32" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="__module.blocks.0.attn/aten::view/Reshape_1" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>1500</dim>
					<dim>384</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="120">
					<dim>-1</dim>
					<dim>1500</dim>
					<dim>6</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="Constant_256" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="2519868" size="32" />
			<output>
				<port id="0" precision="I64" names="121">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="__module.blocks.0.attn/aten::permute/Transpose_1" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>1500</dim>
					<dim>6</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="122,k.3">
					<dim>-1</dim>
					<dim>6</dim>
					<dim>1500</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="__module.blocks.0.attn.value/aten::to/Convert_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="384, 384" offset="2814812" size="294912" />
			<output>
				<port id="0" precision="FP16" names="108">
					<dim>384</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="__module.blocks.0.attn.value/aten::to/Convert" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>384</dim>
					<dim>384</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>384</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="__module.blocks.0.attn.value/aten::linear/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>1500</dim>
					<dim>384</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>384</dim>
					<dim>384</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>1500</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="Constant_4431_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 384" offset="3109724" size="768" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="Constant_4431" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>384</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="__module.blocks.0.attn.value/aten::linear/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>1500</dim>
					<dim>384</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>384</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="110,v.1">
					<dim>-1</dim>
					<dim>1500</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="__module.blocks.0.attn/prim::ListConstruct_2" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="2519836" size="32" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="__module.blocks.0.attn/aten::view/Reshape_2" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>1500</dim>
					<dim>384</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="126">
					<dim>-1</dim>
					<dim>1500</dim>
					<dim>6</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="Constant_284" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="2519868" size="32" />
			<output>
				<port id="0" precision="I64" names="127">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="__module.blocks.0.attn/aten::permute/Transpose_2" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>1500</dim>
					<dim>6</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="128,v.3">
					<dim>-1</dim>
					<dim>6</dim>
					<dim>1500</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="__module.blocks.0.attn/aten::scaled_dot_product_attention/ScaledDotProductAttention" type="ScaledDotProductAttention" version="opset13">
			<data causal="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>6</dim>
					<dim>1500</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>6</dim>
					<dim>1500</dim>
					<dim>64</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>6</dim>
					<dim>1500</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP32" names="129,a.1">
					<dim>-1</dim>
					<dim>6</dim>
					<dim>1500</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="Constant_296" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="2519868" size="32" />
			<output>
				<port id="0" precision="I64" names="130">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="__module.blocks.0.attn/aten::permute/Transpose_3" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>6</dim>
					<dim>1500</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="131">
					<dim>-1</dim>
					<dim>1500</dim>
					<dim>6</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="Constant_4530" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="3110492" size="24" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="__module.blocks.0.attn/aten::flatten/Reshape" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>1500</dim>
					<dim>6</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="132,x.11">
					<dim>-1</dim>
					<dim>1500</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="__module.blocks.0.attn.out/aten::to/Convert_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="384, 384" offset="3110516" size="294912" />
			<output>
				<port id="0" precision="FP16" names="135">
					<dim>384</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="__module.blocks.0.attn.out/aten::to/Convert" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>384</dim>
					<dim>384</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>384</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="__module.blocks.0.attn.out/aten::linear/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>1500</dim>
					<dim>384</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>384</dim>
					<dim>384</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>1500</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="Constant_4432_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 384" offset="3405428" size="768" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="Constant_4432" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>384</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="__module.blocks.0.attn.out/aten::linear/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>1500</dim>
					<dim>384</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>384</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="137">
					<dim>-1</dim>
					<dim>1500</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="__module.blocks.0/aten::add/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>1500</dim>
					<dim>384</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>1500</dim>
					<dim>384</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="138,141,147,input.5,x.13">
					<dim>-1</dim>
					<dim>1500</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="__module.blocks.0.mlp_ln/aten::layer_norm/Multiply" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="2222616" size="4" />
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="__module.blocks.0.mlp_ln/aten::layer_norm/MVN" type="MVN" version="opset6">
			<data eps="9.9999997473787516e-06" normalize_variance="true" eps_mode="INSIDE_SQRT" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>1500</dim>
					<dim>384</dim>
				</port>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>1500</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="Constant_4433_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 384" offset="3406196" size="768" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="Constant_4433" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>384</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="__module.blocks.0.mlp_ln/aten::layer_norm/Multiply_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>1500</dim>
					<dim>384</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>384</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>1500</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="Constant_4434_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 384" offset="3406964" size="768" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="Constant_4434" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>384</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="__module.blocks.0.mlp_ln/aten::layer_norm/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>1500</dim>
					<dim>384</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>384</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="143,144,146,x.15">
					<dim>-1</dim>
					<dim>1500</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="__module.blocks.0.mlp.0/aten::to/Convert_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1536, 384" offset="3407732" size="1179648" />
			<output>
				<port id="0" precision="FP16" names="153">
					<dim>1536</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="__module.blocks.0.mlp.0/aten::to/Convert" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1536</dim>
					<dim>384</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1536</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="__module.blocks.0.mlp.0/aten::linear/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>1500</dim>
					<dim>384</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1536</dim>
					<dim>384</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>1500</dim>
					<dim>1536</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="Constant_4435_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 1536" offset="4587380" size="3072" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1536</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="Constant_4435" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1536</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1536</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="__module.blocks.0.mlp.0/aten::linear/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>1500</dim>
					<dim>1536</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1536</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="155,input.7">
					<dim>-1</dim>
					<dim>1500</dim>
					<dim>1536</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="__module.blocks.0.mlp.1/aten::gelu/Gelu" type="Gelu" version="opset7">
			<data approximation_mode="ERF" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>1500</dim>
					<dim>1536</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="156,x.17">
					<dim>-1</dim>
					<dim>1500</dim>
					<dim>1536</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="__module.blocks.0.mlp.2/aten::to/Convert_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="384, 1536" offset="4590452" size="1179648" />
			<output>
				<port id="0" precision="FP16" names="159">
					<dim>384</dim>
					<dim>1536</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="__module.blocks.0.mlp.2/aten::to/Convert" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>384</dim>
					<dim>1536</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>384</dim>
					<dim>1536</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="__module.blocks.0.mlp.2/aten::linear/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>1500</dim>
					<dim>1536</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>384</dim>
					<dim>1536</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>1500</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="Constant_4436_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 384" offset="5770100" size="768" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="Constant_4436" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>384</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="__module.blocks.0.mlp.2/aten::linear/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>1500</dim>
					<dim>384</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>384</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="161">
					<dim>-1</dim>
					<dim>1500</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="__module.blocks.0/aten::add/Add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>1500</dim>
					<dim>384</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>1500</dim>
					<dim>384</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="162,182,188,input.9,x.19">
					<dim>-1</dim>
					<dim>1500</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="__module.blocks.1.attn_ln/aten::layer_norm/Multiply" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="2222616" size="4" />
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="__module.blocks.1.attn_ln/aten::layer_norm/MVN" type="MVN" version="opset6">
			<data eps="9.9999997473787516e-06" normalize_variance="true" eps_mode="INSIDE_SQRT" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>1500</dim>
					<dim>384</dim>
				</port>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>1500</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="Constant_4437_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 384" offset="5770868" size="768" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="Constant_4437" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>384</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="__module.blocks.1.attn_ln/aten::layer_norm/Multiply_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>1500</dim>
					<dim>384</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>384</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>1500</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="Constant_4438_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 384" offset="5771636" size="768" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="Constant_4438" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>384</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="__module.blocks.1.attn_ln/aten::layer_norm/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>1500</dim>
					<dim>384</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>384</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="184,185,187,x.21">
					<dim>-1</dim>
					<dim>1500</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="__module.blocks.1.attn.query/aten::to/Convert_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="384, 384" offset="5772404" size="294912" />
			<output>
				<port id="0" precision="FP16" names="195">
					<dim>384</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="__module.blocks.1.attn.query/aten::to/Convert" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>384</dim>
					<dim>384</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>384</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="__module.blocks.1.attn.query/aten::linear/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>1500</dim>
					<dim>384</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>384</dim>
					<dim>384</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>1500</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="Constant_4439_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 384" offset="6067316" size="768" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="Constant_4439" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>384</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="__module.blocks.1.attn.query/aten::linear/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>1500</dim>
					<dim>384</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>384</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="197,q.5">
					<dim>-1</dim>
					<dim>1500</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="__module.blocks.1.attn/prim::ListConstruct" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="2519836" size="32" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="__module.blocks.1.attn/aten::view/Reshape" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>1500</dim>
					<dim>384</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="209">
					<dim>-1</dim>
					<dim>1500</dim>
					<dim>6</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="Constant_506" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="2519868" size="32" />
			<output>
				<port id="0" precision="I64" names="210">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="__module.blocks.1.attn/aten::permute/Transpose" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>1500</dim>
					<dim>6</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="211,q.7">
					<dim>-1</dim>
					<dim>6</dim>
					<dim>1500</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="__module.blocks.1.attn.key/aten::to/Convert_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="384, 384" offset="6068084" size="294912" />
			<output>
				<port id="0" precision="FP16" names="199">
					<dim>384</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="__module.blocks.1.attn.key/aten::to/Convert" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>384</dim>
					<dim>384</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>384</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="__module.blocks.1.attn.key/aten::linear/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>1500</dim>
					<dim>384</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>384</dim>
					<dim>384</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="200,k.5">
					<dim>-1</dim>
					<dim>1500</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="110" name="__module.blocks.1.attn/prim::ListConstruct_1" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="2519836" size="32" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="111" name="__module.blocks.1.attn/aten::view/Reshape_1" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>1500</dim>
					<dim>384</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="215">
					<dim>-1</dim>
					<dim>1500</dim>
					<dim>6</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="112" name="Constant_534" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="2519868" size="32" />
			<output>
				<port id="0" precision="I64" names="216">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="113" name="__module.blocks.1.attn/aten::permute/Transpose_1" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>1500</dim>
					<dim>6</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="217,k.7">
					<dim>-1</dim>
					<dim>6</dim>
					<dim>1500</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="114" name="__module.blocks.1.attn.value/aten::to/Convert_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="384, 384" offset="6362996" size="294912" />
			<output>
				<port id="0" precision="FP16" names="203">
					<dim>384</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="115" name="__module.blocks.1.attn.value/aten::to/Convert" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>384</dim>
					<dim>384</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>384</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="116" name="__module.blocks.1.attn.value/aten::linear/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>1500</dim>
					<dim>384</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>384</dim>
					<dim>384</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>1500</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="117" name="Constant_4440_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 384" offset="6657908" size="768" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="118" name="Constant_4440" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>384</dim>
